---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayBackground.HorizontalImageOffset
source: html/b66fe777-bd60-8a0b-4dc0-65e81a25ca55.htm
---
# Autodesk.Revit.DB.ViewDisplayBackground.HorizontalImageOffset Property

The distance between the left viewport boundary and the left edge of the background image.

## Syntax (C#)
```csharp
public double HorizontalImageOffset { get; }
```